// commands for ospf, after configuring pcs, server and routers (use network address that are connected to the router)
    Router 0:
    Router>enable
    Router#conf t
    Enter configuration commands, one per line. End with CNTL/Z.
    Router(config)#router ospf 1
    Router(config-router)#network 192.168.1.0 0.255.255.255 area 1
    Router(config-router)#network 192.168.2.0 0.255.255.255 area 1

    Router 1:
    Router>enable
    Router#conf t
    Enter configuration commands, one per line. End with CNTL/Z.
    Router(config)#router ospf 1
    Router(config-router)#network 192.168.3.0 0.255.255.255 area 1
    Router(config-router)#network 192.168.2.0 0.255.255.255 area 1

// md5 authentication
    Commands for router 0:
    Router(config)#interface gigabitEthernet0/1
    Router(config-if)#ip ospf authentication message-digest
    Router(config-if)#ip ospf message-digest-key 1 md5 sweet

    Commands for router 1:
    Router(config)#interface gigabitEthernet0/1
    Router(config-if)#ip ospf authentication message-digest
    Router(config-if)#ip ospf message-digest-key 1 md5 sweet

// Verifying configuration
    Command: show ip ospf interface gigabitEthernet0/1

// NTP
    Commands (for both routers):
    Router>enable
    Router#conf t
    Enter configuration commands, one per line. End with CNTL/Z.
    Router(config)#ntp server 192.168.1.3
    Router(config)#ntp update-calendar
        Turn off all services in server (192.168.1.3) except NTP

// Syslog
    Turn off all services in server (192.168.1.2) except syslog
    Commands
    Router>enable
    Router#conf t
    Enter configuration commands, one per line. End with CNTL/Z.
    Router(config)#logging 192.168.1.2

// SSH
    Type following commands in Router1:
    enable
    conf t
    ip domain-name sweet.com
    hostname R1
    line vty 0 4
    transport input ssh
    login local
    exit
    username sweet privilege 15 password sweet

Now open cmd of PC and type following command:
Ssh -l sweet 192.168.3.1

